Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDeformedShapeTextLabelType
Defines text visualization types for deformed shape settings of analysis display style.
Since:
2013
Since:
2013

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDeformedShapeTextLabelType.ShowPredefined
Show deformed shape text label only for points that have flag ValueAtPointFlags::DisplayText

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDeformedShapeTextLabelType.ShowNone
Don't show deformed shape text labels

Autodesk.Revit.DB.Analysis.AnalysisDisplayStyleDeformedShapeTextLabelType.ShowAll
Show vector text label for each point